# Análise descritiva
Nessa atividade, o objetivo será demonstrar um pouco sobre a estatística descritiva utilizando quatro tipos de conjuntos de dados diferentes.

### Import packages

In [ ]:
!pip install pandas
import pandas as pd
!pip install seaborn
import seaborn as sns

### Import datasets
Importaremos os datasets disponibilisados pela biblioteca seaborn, são elas: penguins, tips, titanic, anscombe.

Para início dos nossos códigos, começarei importanto as bibliotecas mais importantes que utilizaremos no decorrer da atividade.

In [3]:
# Import penguins
penguins = sns.load_dataset('penguins')
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [17]:
# Import tips
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [18]:
# Import titanic
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [19]:
# Import anscombe
anscombe = sns.load_dataset('anscombe')
anscombe.head()

  dataset     x     y
0       I  10.0  8.04
1       I   8.0  6.95
2       I  13.0  7.58
3       I   9.0  8.81
4       I  11.0  8.33

### Criar dicionário de dados
Agora criaremos um dicionário de dados para cada conjunto de dados, caracterizando cada tipo de coluna por nome, descrição, tipo de dado, e tipo de dado numpy.

Faremos isso utilizando o método de listas, e depois criaremos um dataframe para cada dicionário.

#### Penguins(dic):

In [20]:
penguins_dc = pd.DataFrame({
    'nome_coluna':['species', 'island', 'bill_lenght_mm', 'bill_depth_mm', 'flipper_length_mm', 'body_mass_g', 'sex'],
    'descricao':['Tipo da espécie de pinguim', 'Lugar onde se encontra a espécie', 'Comprimento do bico', 'Profundidade do bico', 'Comprimento da nadadeira', 'Peso em gramas', 'Gênero do animal'],
    'tipo_dado':['Categórico', 'Categórico', 'Numérico', 'Numérico', 'Numérico', 'Numérico', 'Categórico'],
    'tipo_dado_np':['Object', 'Object', 'Float64', 'Float64', 'Float64', 'Float64', 'Object']
})

penguins_dc

,nome_coluna,descricao,tipo_dado,tipo_dado_np
0,species,Tipo da espécie de pinguim,Categórico,Object
1,island,Lugar onde se encontra a espécie,Categórico,Object
2,bill_lenght_mm,Comprimento do bico,Numérico,Float64
3,bill_depth_mm,Profundidade do bico,Numérico,Float64
4,flipper_length_mm,Comprimento da nadadeira,Numérico,Float64
5,body_mass_g,Peso em gramas,Numérico,Float64
6,sex,Gênero do animal,Categórico,Object

#### Tips(dic):

In [21]:
tips_dc = pd.DataFrame({
    'nome_coluna':['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'],
    'descricao':['Total da conta', 'Gorjeta em porcentagem', 'Gênero', 'Fumante ou não?', 'Dia da semana', 'Horário do dia', 'Tamanho'],
    'tipo_dado':['Numérico', 'Numérico', 'Categórico', 'Categórico', 'Categórico', 'Categórico', 'Numérico'],
    'tipo_dado_np':['Float64', 'Float64', 'Category', 'Category', 'Category', 'Category', 'Int64']
})

tips_dc

  nome_coluna               descricao   tipo_dado tipo_dado_np
0  total_bill          Total da conta    Numérico      Float64
1         tip  Gorjeta em porcentagem    Numérico      Float64
2         sex                  Gênero  Categórico     Category
3      smoker         Fumante ou não?  Categórico     Category
4         day           Dia da semana  Categórico     Category
5        time          Horário do dia  Categórico     Category
6        size                 Tamanho    Numérico        Int64

#### Titanic(dic):

In [22]:
titanic_dc = pd.DataFrame({
    'nome_coluna':['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town', 'alive', 'alone'],
    'tipo_dado':['Categórico', 'Numérico', 'Categórico', 'Numérico', 'Numérico', 'Numérico', 'Numérico', 'Categórico', 'Categórico', 'Categórico', 'Categórico', 'Categórico', 'Categórico', 'Categórico', 'Categórico'],
    'tipo_dado_np':['Int64', 'Int64', 'Object', 'Float64', 'Int64', 'Int64', 'Float64', 'Object', 'Category', 'Object', 'Bool', 'Category', 'Object', 'Object', 'Bool']
})

titanic_dc

    nome_coluna   tipo_dado tipo_dado_np
0      survived  Categórico        Int64
1        pclass    Numérico        Int64
2           sex  Categórico       Object
3           age    Numérico      Float64
4         sibsp    Numérico        Int64
5         parch    Numérico        Int64
6          fare    Numérico      Float64
7      embarked  Categórico       Object
8         class  Categórico     Category
9           who  Categórico       Object
10   adult_male  Categórico         Bool
11         deck  Categórico     Category
12  embark_town  Categórico       Object
13        alive  Categórico       Object
14        alone  Categórico         Bool

#### Anscombe(dic):

In [23]:
anscombe_dc = pd.DataFrame({
    'nome_coluna':['dataset', 'x', 'y'],
    'tipo_dado':['Categórico', 'Numérico', 'Numérico'],
    'tipo_dado_np':['Object', 'Float64', 'Float64']
})

anscombe_dc

  nome_coluna   tipo_dado tipo_dado_np
0     dataset  Categórico       Object
1           x    Numérico      Float64
2           y    Numérico      Float64

### Calcular Tendência Central dos conjuntos de dados
 Após a criação dos dicionários, calcularemos mais uma etapa da análise descritiva a partir dos calculos de Tendência Central, como média, mediana e moda para cada dataset.

#### Penguins(TC):

In [24]:
penguins.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

##### Moda:

In [25]:
penguins['bill_length_mm'].mode()

0    41.1
Name: bill_length_mm, dtype: float64

In [26]:
penguins['bill_depth_mm'].mode()

0    17.0
Name: bill_depth_mm, dtype: float64

In [27]:
penguins['flipper_length_mm'].mode()

0    190.0
Name: flipper_length_mm, dtype: float64

In [28]:
penguins['body_mass_g'].mode()

0    3800.0
Name: body_mass_g, dtype: float64

#### Tips(TC)

In [29]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

##### Moda:

In [30]:
tips['total_bill'].mode()

0    13.42
Name: total_bill, dtype: float64

In [31]:
tips['tip'].mode()

0    2.0
Name: tip, dtype: float64

In [32]:
tips['size'].mode()

0    2
Name: size, dtype: int64

#### Titanic(TC)

In [33]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

##### Moda:

In [34]:
titanic['age'].mode()

0    24.0
Name: age, dtype: float64

In [35]:
titanic['sibsp'].mode()

0    0
Name: sibsp, dtype: int64

In [36]:
titanic['parch'].mode()

0    0
Name: parch, dtype: int64

In [37]:
titanic['fare'].mode()

0    8.05
Name: fare, dtype: float64

#### Anscombe(TC)

In [38]:
anscombe.describe()

               x          y
count  44.000000  44.000000
mean    9.000000   7.500682
std     3.198837   1.958925
min     4.000000   3.100000
25%     7.000000   6.117500
50%     8.000000   7.520000
75%    11.000000   8.747500
max    19.000000  12.740000

##### Moda:

In [39]:
anscombe['x'].mode()

0    8.0
Name: x, dtype: float64

In [40]:
anscombe['y'].mode()

0    8.84
Name: y, dtype: float64

### Calcular Dispersão
Agora, iremos descobrir as medidas de dispersão dos conjuntos de dados por meio de funções.

Medidas de dispersão são parâmetros estatísticos usados para determinar o grau de variabilidade dos dados de um conjunto de valores.

O cálculo desses parâmetros tornam a análise de uma amostra mais confiável, já que as variáveis de tendência central (média, mediana, moda) muitas vezes não demonstram a homogeneidade dos dados.

As medidas de dispersão são: desvio padrão, amplitude, e intervalo.

#### Penguins

In [41]:
# View dataset
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

##### Desvio Padrão:

In [42]:
# comprimento do bico
penguins['bill_length_mm'].std()

5.4595837139265315

In [43]:
# Profundidade do bico
penguins['bill_depth_mm'].std()

1.9747931568167816

In [44]:
# Comprimento da nadadeira
penguins['flipper_length_mm'].std()

14.061713679356888

In [45]:
# Massa corporal
penguins['body_mass_g'].std()

801.9545356980956

##### Valor Interquantil (amplitude):

In [46]:
penguins.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

In [47]:
# comprimento do bico
Q1 = penguins['bill_length_mm'].quantile(0.25)
Q2 = penguins['bill_length_mm'].quantile(0.5)
Q3 = penguins['bill_length_mm'].quantile(0.75)
print('Primeiro quartil ', Q1)
print('Segundo quartil (Mediana)', Q2)
print('Terceiro quartil ', Q3)

Primeiro quartil  39.225
Segundo quartil (Mediana) 44.45
Terceiro quartil  48.5

In [48]:
IQR_1 = Q3 - Q1
print('Intervalo interquartil ', IQR_1)

Intervalo interquartil  9.274999999999999

In [49]:
# Profundidade do bico
Q1 = penguins['bill_depth_mm'].quantile(0.25)
Q2 = penguins['bill_depth_mm'].quantile(0.5)
Q3 = penguins['bill_depth_mm'].quantile(0.75)
print('Primeiro quartil ', Q1)
print('Segundo quartil (Mediana)', Q2)
print('Terceiro quartil ', Q3)

Primeiro quartil  15.6
Segundo quartil (Mediana) 17.3
Terceiro quartil  18.7

In [50]:
IQR_2 = Q3 - Q1
print('Intervalo interquartil ', IQR_2)

Intervalo interquartil  3.0999999999999996

In [51]:
# Comprimento da nadadeira
Q1 = penguins['flipper_length_mm'].quantile(0.25)
Q2 = penguins['flipper_length_mm'].quantile(0.5)
Q3 = penguins['flipper_length_mm'].quantile(0.75)
print('Primeiro quartil ', Q1)
print('Segundo quartil (Mediana)', Q2)
print('Terceiro quartil ', Q3)

Primeiro quartil  190.0
Segundo quartil (Mediana) 197.0
Terceiro quartil  213.0

In [52]:
IQR_3 = Q3 - Q1
print('Intervalo interquartil ', IQR_3)

Intervalo interquartil  23.0

In [53]:
# Massa corporal
Q1 = penguins['body_mass_g'].quantile(0.25)
Q2 = penguins['body_mass_g'].quantile(0.5)
Q3 = penguins['body_mass_g'].quantile(0.75)
print('Primeiro quartil ', Q1)
print('Segundo quartil (Mediana)', Q2)
print('Terceiro quartil ', Q3)

Primeiro quartil  3550.0
Segundo quartil (Mediana) 4050.0
Terceiro quartil  4750.0

In [54]:
IQR_4 = Q3 - Q1
print('Intervalo interquartil ', IQR_4)

Intervalo interquartil  1200.0

##### Intervalo:

In [58]:
# comprimento do bico
print("Intervalo: ", (penguins['bill_length_mm'].max() - penguins['bill_length_mm'].min()))

Intervalo:  27.5

In [57]:
# Profundidade do bico
print("Intervalo: ", (penguins['bill_depth_mm'].max() - penguins['bill_depth_mm'].min()))

Intervalo:  8.4

In [60]:
# Comprimento da nadadeira
print("Intervalo: ", (penguins['flipper_length_mm'].max() - penguins['flipper_length_mm'].min()))

Intervalo:  59.0

In [61]:
# Massa corporal
print("Intervalo: ", (penguins['body_mass_g'].max() - penguins['body_mass_g'].min()))

Intervalo:  3600.0

#### Tips

In [87]:
# View dataset
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

##### Desvio Padrão:

In [63]:
# Conta total
tips['total_bill'].std()

8.902411954856856

In [64]:
# Gorjeta
tips['tip'].std()

1.3836381890011822

In [65]:
# Tamanho
tips['size'].std()

0.9510998047322344

##### Valor Interquantil (amplitude):

In [66]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [67]:
# Conta total
Q1 = tips['total_bill'].quantile(0.25)
Q2 = tips['total_bill'].quantile(0.5)
Q3 = tips['total_bill'].quantile(0.75)
print('Primeiro quartil ', Q1)
print('Segundo quartil (Mediana)', Q2)
print('Terceiro quartil ', Q3)

Primeiro quartil  13.3475
Segundo quartil (Mediana) 17.795
Terceiro quartil  24.127499999999998

In [68]:
IQR_5 = Q3 - Q1
print('Intervalo interquartil ', IQR_5)

Intervalo interquartil  10.779999999999998

In [69]:
# Gorjeta
Q1 = tips['tip'].quantile(0.25)
Q2 = tips['tip'].quantile(0.5)
Q3 = tips['tip'].quantile(0.75)
print('Primeiro quartil ', Q1)
print('Segundo quartil (Mediana)', Q2)
print('Terceiro quartil ', Q3)

Primeiro quartil  2.0
Segundo quartil (Mediana) 2.9
Terceiro quartil  3.5625

In [70]:
IQR_6 = Q3 - Q1
print('Intervalo interquartil ', IQR_6)

Intervalo interquartil  1.5625

In [71]:
# Tamanho
Q1 = tips['size'].quantile(0.25)
Q2 = tips['size'].quantile(0.5)
Q3 = tips['size'].quantile(0.75)
print('Primeiro quartil ', Q1)
print('Segundo quartil (Mediana)', Q2)
print('Terceiro quartil ', Q3)

Primeiro quartil  2.0
Segundo quartil (Mediana) 2.0
Terceiro quartil  3.0

In [72]:
IQR_7 = Q3 - Q1
print('Intervalo interquartil ', IQR_7)

Intervalo interquartil  1.0

##### Intervalo

In [74]:
# Conta total
print("Intervalo: ", (tips['total_bill'].max() - tips['total_bill'].min()))

Intervalo:  47.74

In [75]:
# Gorjeta
print("Intervalo: ", (tips['tip'].max() - tips['tip'].min()))

Intervalo:  9.0

In [77]:
# Tamanho
print("Intervalo: ", (tips['size'].max() - tips['size'].min()))

Intervalo:  5

#### Titanic

In [81]:
# view dataset
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

##### Desvio Padrão:

In [82]:
# Classe do passageiro
titanic['pclass'].std()

0.836071240977049

In [80]:
# Idade
titanic['age'].std()

14.526497332334042

In [83]:
# Numero de irmãos e esposos(as) abordo
titanic['sibsp'].std()

1.1027434322934317

In [84]:
# Numero de crianças e parentes abordo
titanic['parch'].std()

0.8060572211299483

In [85]:
# Tarifa do passageiro
titanic['fare'].std()

49.6934285971809

##### Valor Interquantil (amplitude):

In [86]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [88]:
# Idade
Q1 = titanic['age'].quantile(0.25)
Q2 = titanic['age'].quantile(0.5)
Q3 = titanic['age'].quantile(0.75)
print('Primeiro quartil ', Q1)
print('Segundo quartil (Mediana)', Q2)
print('Terceiro quartil ', Q3)

Primeiro quartil  20.125
Segundo quartil (Mediana) 28.0
Terceiro quartil  38.0

In [89]:
IQR_9 = Q3 - Q1
print('Intervalo interquartil ', IQR_9)

Intervalo interquartil  17.875

In [90]:
# Tarifa do passageiro
Q1 = titanic['fare'].quantile(0.25)
Q2 = titanic['fare'].quantile(0.5)
Q3 = titanic['fare'].quantile(0.75)
print('Primeiro quartil ', Q1)
print('Segundo quartil (Mediana)', Q2)
print('Terceiro quartil ', Q3)

Primeiro quartil  7.9104
Segundo quartil (Mediana) 14.4542
Terceiro quartil  31.0

In [91]:
IQR_12 = Q3 - Q1
print('Intervalo interquartil ', IQR_12)

Intervalo interquartil  23.0896

##### Intervalo:

In [92]:
# Classe do passageiro
titanic['pclass'].max() - titanic['pclass'].min()

2

In [93]:
# Idade
titanic['age'].max() - titanic['age'].min()

79.58

In [94]:
# Numero de irmãos e esposos(as) abordo
titanic['sibsp'].max() - titanic['sibsp'].min()

8

In [95]:
# Numero de crianças e parentes abordo
titanic['parch'].max() - titanic['parch'].min()

6

In [96]:
# Tarifa do passageiro
titanic['fare'].max() - titanic['fare'].min()

512.3292

#### Anscombe

In [97]:
anscombe.describe()

               x          y
count  44.000000  44.000000
mean    9.000000   7.500682
std     3.198837   1.958925
min     4.000000   3.100000
25%     7.000000   6.117500
50%     8.000000   7.520000
75%    11.000000   8.747500
max    19.000000  12.740000

##### Desvio Padrão:

In [98]:
anscombe['x'].std()

3.198836997962679

In [99]:
anscombe['y'].std()

1.958925189078419

##### Intervalo Interquantil (amplitude):

In [100]:
anscombe.describe()

               x          y
count  44.000000  44.000000
mean    9.000000   7.500682
std     3.198837   1.958925
min     4.000000   3.100000
25%     7.000000   6.117500
50%     8.000000   7.520000
75%    11.000000   8.747500
max    19.000000  12.740000

In [101]:
Q1 = anscombe['x'].quantile(0.25)
Q2 = anscombe['x'].quantile(0.5)
Q3 = anscombe['x'].quantile(0.75)
print('Primeiro quartil ', Q1)
print('Segundo quartil (Mediana)', Q2)
print('Terceiro quartil ', Q3)

Primeiro quartil  7.0
Segundo quartil (Mediana) 8.0
Terceiro quartil  11.0

In [102]:
IQR_13 = Q3 - Q1
print('Intervalo interquartil ', IQR_13)

Intervalo interquartil  4.0

In [103]:
Q1 = anscombe['y'].quantile(0.25)
Q2 = anscombe['y'].quantile(0.5)
Q3 = anscombe['y'].quantile(0.75)
print('Primeiro quartil ', Q1)
print('Segundo quartil (Mediana)', Q2)
print('Terceiro quartil ', Q3)

Primeiro quartil  6.1175
Segundo quartil (Mediana) 7.52
Terceiro quartil  8.7475

In [104]:
IQR_14 = Q3 - Q1
print('Intervalo interquartil ', IQR_14)

Intervalo interquartil  2.630000000000001

##### Intervalo

In [105]:
print("Intervalo: ", (anscombe['x'].max() - anscombe['x'].min()))

Intervalo:  15.0

In [107]:
print("Intervalo: ", (anscombe['y'].max() - anscombe['y'].min()))

Intervalo:  9.64

### Variáveis qualitativas
Agora vamos calcular alguns percentuais estatísticos das variáveis qualitativas de cada conjunto de dados.

#### Penguins

In [109]:
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [133]:
# Contamos o número de ocorrências para cada valor por sexo
frequencia_sex = penguins['sex'].value_counts()
frequencia_sex

sex
Male      168
Female    165
Name: count, dtype: int64

In [134]:
# Calculamos a porcentagem para cada valor
percentual_sex = penguins['sex'].value_counts(normalize = True) * 100
percentual_sex

sex
Male      50.45045
Female    49.54955
Name: proportion, dtype: float64

In [135]:
# Construímos o DataFrame com a frequência e o percentual
dist_freq_qualitativa = pd.DataFrame({'Frequência': frequencia_sex, 'Porcentagem(%)': percentual_sex})
dist_freq_qualitativa

        Frequência  Porcentagem(%)
sex
Male           168        50.45045
Female         165        49.54955

In [136]:


dist_freq_qualitativa

        Frequência  Porcentagem(%)
sex
Male           168        50.45045
Female         165        49.54955

In [139]:
# Contamos o número de ocorrências para cada valor por espécie
frequencia_species = penguins['species'].value_counts()
frequencia_species

species
Adelie       152
Gentoo       124
Chinstrap     68
Name: count, dtype: int64

In [150]:
# Contamos o número de ocorrências para cada valor por ilha
frequencia_island = penguins['island'].value_counts()
frequencia_island

island
Biscoe       168
Dream        124
Torgersen     52
Name: count, dtype: int64

In [199]:
#vamos fazer uma distribuição de frequência relacionanso sexo e espécie através de um dicionário

sexo = {0: 'Masculino',
        1: 'Feminino'}

especie = {0:'Adelie',
           1:'Gentoo',
           2:'Chinstrap'}

In [200]:
# construindo a tabela de frequência
frequencia = pd.crosstab(penguins.sex, penguins.species)
frequencia

species  Adelie  Chinstrap  Gentoo
sex
Female       73         34      58
Male         73         34      61

In [201]:
#Podemos fazer a distribuição de frequências percentuais através de normalize:

percentual = pd.crosstab(penguins.sex, penguins.species, normalize = True)*100

percentual.rename(index = sexo, inplace = True)

percentual.rename(columns = especie, inplace = True)

percentual

species     Adelie  Chinstrap     Gentoo
sex
Female   21.921922   10.21021  17.417417
Male     21.921922   10.21021  18.318318

In [221]:
# média de espécie Adelie por sexo
frequencia.groupby(['sex'])['Adelie'].mean()

sex
Female    73.0
Male      73.0
Name: Adelie, dtype: float64

In [223]:
# média de espécie Chinstrap por sexo
frequencia.groupby(['sex'])['Chinstrap'].mean()

sex
Female    34.0
Male      34.0
Name: Chinstrap, dtype: float64

In [224]:
# média de espécie Gentoo por sexo
frequencia.groupby(['sex'])['Gentoo'].mean()

sex
Female    58.0
Male      61.0
Name: Gentoo, dtype: float64

#### Tips

In [202]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [203]:
# Contamos o número de ocorrências para cada valor por sexo
frequencia_sex1 = tips['sex'].value_counts()
frequencia_sex1

sex
Male      157
Female     87
Name: count, dtype: int64

In [204]:
# Calculamos a porcentagem para cada valor
percentual_sex1 = tips['sex'].value_counts(normalize = True)*100
percentual_sex1

sex
Male      64.344262
Female    35.655738
Name: proportion, dtype: float64

In [205]:
# Construímos o DataFrame com a frequência e o percentual
dist_freq_qualitativa1 = pd.DataFrame({'Frequência': frequencia_sex1, 'Porcentagem(%)': percentual_sex1})
dist_freq_qualitativa1

        Frequência  Porcentagem(%)
sex
Male           157       64.344262
Female          87       35.655738

In [206]:
# Contamos o número de ocorrências para cada valor por dia
frequencia_day = tips['day'].value_counts()
frequencia_day

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [207]:
# Contamos o número de ocorrências para cada valor por horário
frequencia_time = tips['time'].value_counts()
frequencia_time

time
Dinner    176
Lunch      68
Name: count, dtype: int64

In [208]:
#vamos fazer uma distribuição de frequência relacionanso sexo e time através de um dicionário

sexo = {0: 'Masculino',
        1: 'Feminino'}

time = {0:'Dinner',
        1:'Lunch',
        }

In [209]:
# construindo a tabela de frequência
frequencia1 = pd.crosstab(tips.sex, tips.time)
frequencia1

time    Lunch  Dinner
sex
Male       33     124
Female     35      52

In [210]:
# média de almoço por sexo
frequencia1.groupby(['sex'])['Lunch'].mean()

C:\Users\letic\AppData\Local\Temp\ipykernel_7300\1168327198.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  frequencia1.groupby(['sex'])['Lunch'].mean()

sex
Male      33.0
Female    35.0
Name: Lunch, dtype: float64

In [211]:
# média de janta por sexo
frequencia1.groupby(['sex'])['Dinner'].mean()

C:\Users\letic\AppData\Local\Temp\ipykernel_7300\2090167090.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  frequencia1.groupby(['sex'])['Dinner'].mean()

sex
Male      124.0
Female     52.0
Name: Dinner, dtype: float64

In [212]:
print("Média de almoço: ", (frequencia1.Lunch.mean()))

Média de almoço:  34.0

In [213]:
print("Média de janta: ", (frequencia1.Dinner.mean()))

Média de janta:  88.0

#### Titanic

In [214]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [215]:
# Contamos o número de ocorrências para cada valor por sexo
frequencia_sex2 = titanic['sex'].value_counts()
frequencia_sex2

sex
male      577
female    314
Name: count, dtype: int64

In [216]:
# Contamos o número de ocorrências para cada valor por classe
frequencia_class = titanic['class'].value_counts()
frequencia_class

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [217]:
# Contamos o número de ocorrências para cada valor por cidade de embarque
frequencia_town = titanic['embark_town'].value_counts()
frequencia_town

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [218]:
# Contamos o número de ocorrências para cada valor se vivo ou não
frequencia_alive = titanic['alive'].value_counts()
frequencia_alive

alive
no     549
yes    342
Name: count, dtype: int64

In [219]:
#vamos fazer uma distribuição de frequência relacionanso sexo e alive através de um dicionário

sexo = {0: 'Masculino',
        1: 'Feminino'}

time = {0:'no',
        1:'yes',
        }

In [192]:
# construindo a tabela de frequência
frequencia2 = pd.crosstab(titanic.sex, titanic.alive)
frequencia2

alive    no  yes
sex
female   81  233
male    468  109

In [196]:
# média de pessoas que morreram por sexo
frequencia2.groupby(['sex'])['no'].mean()

sex
female     81.0
male      468.0
Name: no, dtype: float64